package Task9;

import java.util.ArrayList;
import java.util.List;

public class Main {
    public static void main(String[] args) {


   List<int []> city = new ArrayList<>(){


   };
    }
}


//Домашнее задание на выходные
//Пока сбрасываю задачку попроще, позже будет вторая
//
//Задание 9.1. Один день из жизни автобуса
//
//Автобус собирает и высаживает пассажиров на каждой остановке.
// Остановки представлены списком массивов - List<int[]>, где каждый из массивов представляет остановку, и состоит из 2 элементов:
//1) количество зашедших в автобус человек
//2) количество вышедших из автобуса человек
//Задача - подсчитать количество людей в автобусе,
// после того как автобус объедет все остановки
// (т.е. прибудет на конечную). Количество не должно оказаться отрицательным.
//Написать решение в функциональном стиле (стримы, лямбды, ...)